oceanLife!/app/controllers/api/v1/oceans_controller.rb

  def index
  	@oceans = Ocean.all
---
SELECT "oceans".* FROM "oceans"

  def show
    @ocean = Ocean.find(params[:id])
---
SELECT  "oceans".* FROM "oceans" WHERE "oceans"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]