oceanLife!/app/controllers/api/v1/sea_lives_controller.rb

UPDATE "sea_lives" SET "isMyFavorite" = $1, "updated_at" = $2 WHERE "sea_lives"."id" = $3  [["isMyFavorite", false], ["updated_at", "2019-01-22 17:07:51.022929"], ["id", 1]]
UPDATE "sea_lives" SET "isMyFavorite" = $1, "updated_at" = $2 WHERE "sea_lives"."id" = $3  [["isMyFavorite", true], ["updated_at", "2019-01-22 17:09:42.657805"], ["id", 3]]
---
  def update
    @seaLife.update(seaLives_params)
    if @seaLife.save